SVNREPO_HoldMyMemories_ApplicationServer/test.xml

SOAPAction: "http://www.webserviceX.NET/GetInfoByZIP", Content-Type: text/xml;charset=UTF-8, Content-Length: 380
<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:wsdl="http://www.webserviceX.NET" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ins0="http://www.webserviceX.NET" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><ins0:GetInfoByZIP><wsdl:id>1</wsdl:id></ins0:GetInfoByZIP></env:Body></env:Envelope>
HTTPI executes HTTP POST using the httpclient adapter
SOAP response (status 200):
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GetInfoByZIPResponse xmlns="http://www.webserviceX.NET" /></soap:Body></soap:Envelope>
=> #<Savon::SOAP::Response:0xb6bed4b0 @http=#<HTTPI::Response:0xb6bed2bc @code=200, @headers={"X-Powered-By"=>"ASP.NET", "X-Cache"=>"MISS from WebFilter.webfilter.com", "Via"=>"1.0 WebFilter.webfilter.com:8080 (http_scan/4.0.2.6.19)", "Content-Type"=>"text/xml; charset=utf-8", "Date"=>"Tue, 31 Jan 2012 12:47:16 GMT", "Content-Length"=>"305", "Server"=>"Microsoft-IIS/7.0", "Cache-Control"=>"private, max-age=0", "X-AspNet-Version"=>"4.0.30319", "Connection"=>"close"}, @raw_body="<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><GetInfoByZIPResponse xmlns=\"http://www.webserviceX.NET\" /></soap:Body></soap:Envelope>", @body="<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><GetInfoByZIPResponse xmlns=\"http://www.webserviceX.NET\" /></soap:Body></soap:Envelope>">, @soap_fault=Savon::SOAP::Fault, @http_error=Savon::HTTP::Error>
